{"pageProps":{"blogPost":{"title":"Struggles with scully","description":"why is everything so difficult?","published":true,"date":"2021-11-22T00:00:00.000Z","slug":"struggles-with-scully"},"markdown":"<h1 id=\"struggles-with-scully\">Struggles with scully</h1>\n<p>I spent a good few hours today bashing my head against a feature for this portfolio I just <strong>couldn't</strong> get working.\nThe basic idea was to leverage scully's <code>transferState</code> service to \"save\" github API data I load, so I could integrate\nmy github gist snippets into this app.</p>\n<p>However, I ran into issues at every turn with minimal insight into what was going on.</p>\n<ol>\n<li><p>Github's api is rate limited to 60 requests per hour. I would hit this and only get a small <code>403</code> error in my scully build.\nFurthermore, I couldn't get any further insight into the error beyond the code, so I can to manually add log statements in the library to get any idea\nthat I was getting rate limited.</p>\n</li>\n<li><p>To workaround the rate limit, I got a personal access token and set it up for codespaces. This would of been ok, except\nI had a typo in my header, and ran into more vague errors.</p>\n</li>\n<li><p>After realizing my mistake, I started on the actual feature where I assumed I could use scully to get the raw data from the api,\nand then manage it within the app. Instead, I just got the <code>id</code> property and nothing else. <strong>I should look back into this part, as I might of overlooked a feature\nof scully.</strong> Regardless, because I just got the <code>id</code>, I thought I could use the <code>transferState</code> service to \"save\" the full data, <strong>if</strong> I make a direct call\nvia <code>http</code> to the API, through it.</p>\n</li>\n<li><p>I updated my github api service to make the call, and only got <code>undefined</code> in return. After bashing my head against the service more, I realized\nthe <code>transferState</code> was returning undefined because it was <strong>getting an error</strong>. By this point I stopped, as this is around the third time scully has\ndirectly hidden errors from me, which is a <strong>huge</strong> pain when the docs are missing so much.</p>\n</li>\n</ol>\n<p>Because of this, I might start looking for alternative static site generators for Angular (or just bite the bullet and not use Angular!).\nIts one thing to lack features, but to spend so much time fighting the framework itself is just too annoying.</p>\n<p>With this post, I think I'll start spending some time on my other side projects that don't rely on scully.\nThe first project will be the flash card app, which is connected to firebase, but doesn't have much UI.</p>\n<p>The other project will be the chrome-neo app, which will be a new version of the chrome-neo chrome extension I made for college using angular.js.\nThis new version will probably also rely on firebase, and provide more features than the current version.</p>\n<p>Keep learning, keep building :+1:</p>\n"},"__N_SSG":true}