{"pageProps":{"blogPost":{"title":"new-year-same-stuff","description":"Still making progress, but not where it counts","published":true,"date":"2022-01-12T00:00:00.000Z","slug":"new-year-same-stuff"},"markdown":"<h1 id=\"new-year-same-stuff\">new-year-same-stuff</h1>\n<p>Hello world 2022!</p>\n<p>Its a new year, but same stuff going on for me. The projects I have lined up are still lined up. I also started advent of code 2021, but couldn't get past the first few days due to time commitments and the usual laziness. I <strong>may</strong> go back and work on that in the future, but for now its on the way side.</p>\n<p>The primary effort has been focused on my <code>nx-workspace-template</code> repo. I've been adding common functions and utilities to that repo so it should be easier to get going faster. However, this project is more of the usual \"optimize the flow\", when really I still need to put the work in to finish the projects I already got.</p>\n<p>Beyond <code>nx-workspace-template</code>, I've got the same projects more or less lined up waiting for contributions:</p>\n<ul>\n<li>\"Flash card app\" which <strong>still</strong> needs to be finished, and has been paused more or less before anything has actually gotten going.<ul>\n<li>this project might also be migrated to the <code>nx-workspace-template</code>, so things can get going faster in terms of the CI/CD updates. However the costs related to this, as its a private github project will probably explode. So more improvements need to be made on that front.</li>\n</ul>\n</li>\n<li>chrome-neo-2 chrome extension replacement for my older chrome-neo project<ul>\n<li>this project might actually get <strong>replaced</strong> with a new version that will use the <code>nx-workspace-template</code> repo.</li>\n</ul>\n</li>\n<li>advent of code 2021 - continue grinding it out with the advent of code puzzles</li>\n<li>codewars-node-api - I need to finalize the docs on this one and show \"some life\".</li>\n</ul>\n<p><strong>Book Update</strong></p>\n<p>I finished Dune over the break, it was very much a grind. I moved onto a book called \"Recursion\", but Blake Crouch as a \"palette\" cleanser and it was a nice read I got through in roughly week.\nI'm going to re-read \"The Phoenix Project\" to get back into the spirit of DevOps, and hopefully re-focus on one of the many side-projects I have with the spare time I do have.</p>\n<p>Until next time, keep learning, keep building!</p>\n"},"__N_SSG":true}