{"pageProps":{"blogPost":{"title":"the-halloween-edition","description":"Longer overdue updates","published":true,"date":"2021-10-31T00:00:00.000Z","slug":"the-halloween-edition"},"markdown":"<h1 id=\"the-halloween-edition\">the-halloween-edition</h1>\n<p>Happy Halloween for those that celebrate it!</p>\n<p>So, I've been <strong>busy</strong>. To busy to work on side-projects, this site, or even finish\nhacktoberfest. I was able to get in 2 accepted PR's, but my third isn't finished, and\nI never found time to get my fourth and last one. I was going to plant a tree this year,\nbut it seems like I wont even be able to find enough time to contribute enough to accomplish that!</p>\n<p>Regardless, I've been busy working and handling a bunch of stuff outside of development,\nlike hosting some parties, and going to live events. Its been great to actually get\nback into things after not doing anything for over a year.</p>\n<p><strong>Future Work</strong></p>\n<p>My side projects have languished behind my few hacktoberfest contributions, and I look forward\nto getting back into them now that I wont feel guilty working on them. I have 2 projects I want\nto focus on the next few months before the end of the year.</p>\n<ol>\n<li><p>Flash Card App - this was the one I mentioned in the last post. The last thing I\nwas able to finish before focusing on hacktoberfest was the actual ngrx+firestore state management.\nI'm on the side of \"its too complex for its own good\" right now, but it was a nice learning experience.</p>\n</li>\n<li><p>Chrome-neo2 - the original version hasn't been updated for years. I think expanding\non it should be necessary given that the chrome store has changed a number of policies.\nTo the point I'm not sure if my extension can be updated without updating a number of properties.</p>\n</li>\n</ol>\n<p>I think re-looking into chrome extension development with all of what I've learned would be an\ninteresting and fun experience.</p>\n<p>Until the next time, keep building, keep learning!</p>\n"},"__N_SSG":true}